src/Catalogs/mega_Номенклатура/mega_Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидДетали</name>
    <type>
      <types>CatalogRef.mega_ВидыДеталей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериалаДетали</name>
    <type>
      <types>CatalogRef.mega_ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <type>
      <types>CatalogRef.mega_КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.mega_ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.mega_Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДетали</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТолщины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.mega_ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйРесурс</name>
    <type>
      <types>CatalogRef.mega_ПроизводственныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.mega_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Код_УТ103</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСопутствующиеИзделия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроизводственная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/mega_Номенклатура/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СтарыеЗначения; // см. СтарыеЗначения

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда 
		
		Если ЭтоНовый()Тогда 
			
			ПоследнийКод = Справочники.mega_Номенклатура.ПолучитьПоследнийКод();
			КодДляШтрихкода = Формат(Число(ПоследнийКод) + 1, "ЧЦ=7; ЧДЦ=0; ЧГ=0");
		Иначе 
			
			КодДляШтрихкода = Код;
		КонецЕсли;
		
		
		Штрихкод = КодДляШтрихкода + mega_Штрихкодирование.КонтрольныйСимволEAN(КодДляШтрихкода, 8);
		
		Если ТипНоменклатуры = Перечисления.mega_ТипыНоменклатуры.Деталь Тогда
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("ВидДетали", ВидДетали);
			СтруктураПараметров.Вставить("ВидМатериалаДетали", ВидМатериалаДетали);
			СтруктураПараметров.Вставить("ПоказательТолщины", ПоказательТолщины);
			СтруктураПараметров.Вставить("Штрихкод", Штрихкод);
			КодДетали = Справочники.mega_Номенклатура.СформироватьКодДетали(СтруктураПараметров);
			Наименование = Справочники.mega_Номенклатура.СформироватьНаименованиеДетали(СтруктураПараметров);
			
		Иначе
			
			ВидДетали = Неопределено;
			ВидМатериалаДетали = Неопределено;
			КодДетали = "";
			ПоказательТолщины = "";
						
		КонецЕсли;
		
		ЕстьСопутствующиеИзделия = РегистрыСведений.mega_СопутствующиеИзделия.ЕстьСопутствующиеИзделия(Ссылка);
		Если ТипНоменклатуры <> Перечисления.mega_ТипыНоменклатуры.Операция Тогда
			
			НеПроизводственная = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	ЕдиницаИзмерения = Неопределено;
	Спецификация = Неопределено;
	
	Код_УТ103 = "";
		
	Комментарий = "";
	НаименованиеПолное = "";
	Описание = ""; 		
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = "8";
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции.

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
